package com.a9.aarti.aarti.StaticData;

import com.a9.aarti.aarti.Model.Aarti;
import com.a9.aarti.aarti.R;

import java.util.ArrayList;
import java.util.List;

public class AartiData {




    public static List<Aarti> getList()
    {
        List<Aarti> list = new ArrayList<Aarti>();

        list.add(getShivAarti());
        list.add(getSriRamAarti());
        list.add(getHanumanAarti());
        list.add(getAmbeAarti());
        list.add(getLakshmiAarti());
        list.add(getShreeGaneshAarti());
        list.add(getJagdishAarti());
        list.add(getViashnoAarti());
        list.add(getKunjBihariAarti());
        list.add(getsarashvatiAarti());
        list.add(getVinayakAarti());
        list.add(getGanapatiAarti());
        list.add(getDurgaAarti());
        list.add(getParvatiAarti());
        list.add(getNarshimhBahgwanAarti());
        //list.add(getNarshimhAarti());
        list.add(getShaniAarti());
        list.add(getPurshotamAarti());
        list.add(getSuryadevAarti());
        list.add(getSatyaNarayanAarti());
        list.add(getSantoshiAarti());
        list.add(getEkadashiAarti());
        list.add(getGangaAarti());
        //list.add(getRamayanAarti());
        list.add(getBakeBihariAarti());
        list.add(getChitraGuptAarti());
        return list;
    }


    public static Aarti getHanumanAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.hanuman);
        aarti.setTitle("आरती श्री हनुमानजी");
        aarti.setDescription("आरती कीजै हनुमान लला की। दुष्ट दलन रघुनाथ कला की॥\n" +
                "\n" +
                "जाके बल से गिरिवर कांपे। रोग दोष जाके निकट न झांके॥\n" +
                "\n" +
                "अंजनि पुत्र महा बलदाई। सन्तन के प्रभु सदा सहाई॥\n" +
                "\n" +
                "दे बीरा रघुनाथ पठाए। लंका जारि सिया सुधि लाए॥\n" +
                "\n" +
                "लंका सो कोट समुद्र-सी खाई। जात पवनसुत बार न लाई॥\n" +
                "\n" +
                "लंका जारि असुर संहारे। सियारामजी के काज सवारे॥\n" +
                "\n" +
                "लक्ष्मण मूर्छित पड़े सकारे। आनि संजीवन प्राण उबारे॥\n" +
                "\n" +
                "पैठि पाताल तोरि जम-कारे। अहिरावण की भुजा उखारे॥\n" +
                "\n" +
                "बाएं भुजा असुरदल मारे। दाहिने भुजा संतजन तारे॥\n" +
                "\n" +
                "सुर नर मुनि आरती उतारें। जय जय जय हनुमान उचारें॥\n" +
                "\n" +
                "कंचन थार कपूर लौ छाई। आरती करत अंजना माई॥\n" +
                "\n" +
                "जो हनुमानजी की आरती गावे। बसि बैकुण्ठ परम पद पावे॥\n" +
                "\n");
        return aarti;
    }

    public static Aarti getSriRamAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.sri_ram);
        aarti.setTitle("आरती श्री रामचन्द्रजी ");
        aarti.setDescription("श्री रामचन्द्र कृपालु भजु मन, हरण भवभय दारुणम्।\n" +
                "नव कंज लोचन, कंज मुख कर कंज पद कंजारुणम्॥\n" +
                "श्री रामचन्द्र कृपालु भजु मन...।\n" +
                "कन्दर्प अगणित अमित छवि, नव नील नीरद सुन्दरम्।\n" +
                "पट पीत मानहुं तड़ित रूचि-शुचि नौमि जनक सुतावरम्॥\n" +
                "श्री रामचन्द्र कृपालु भजु मन...।\n" +
                "भजु दीनबंधु दिनेश दानव दैत्य वंश निकन्दनम्।\n" +
                "रघुनन्द आनन्द कन्द कौशल चन्द्र दशरथ नन्द्नम्॥\n" +
                "श्री रामचन्द्र कृपालु भजु मन...।\n" +
                "सिर मुकुट कुंडल तिलक चारू उदारु अंग विभूषणम्।\n" +
                "आजानुभुज शर चाप-धर, संग्राम जित खरदूषणम्॥\n" +
                "श्री रामचन्द्र कृपालु भजु मन...।\n" +
                "इति वदति तुलसीदास, शंकर शेष मुनि मन रंजनम्।\n" +
                "मम ह्रदय कंज निवास कुरु, कामादि खल दल गंजनम्॥\n" +
                "श्री रामचन्द्र कृपालु भजु मन...।\n" +
                "मन जाहि राचेऊ मिलहि सो वर सहज सुन्दर सांवरो।\n" +
                "करुणा निधान सुजान शील सनेह जानत रावरो॥\n" +
                "श्री रामचन्द्र कृपालु भजु मन...।\n" +
                "एहि भांति गौरी असीस सुन सिय हित हिय हरषित अली।\n" +
                "तुलसी भवानिहि पूजी पुनि-पुनि मुदित मन मन्दिर चली॥\n" +
                "श्री रामचन्द्र कृपालु भजु मन...।");

        return aarti;
    }

    public static Aarti getShivAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.shiv);
        aarti.setTitle("शिवजी की आरती ");
        aarti.setDescription("ॐ जय शिव ओंकारा, स्वामी जय शिव ओंकारा।\n" +
                "ब्रह्मा, विष्णु, सदाशिव, अर्द्धांगी धारा॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "एकानन चतुरानन पञ्चानन राजे।\n" +
                "हंसासन गरूड़ासन वृषवाहन साजे॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "दो भुज चार चतुर्भुज दसभुज अति सोहे।\n" +
                "त्रिगुण रूप निरखते त्रिभुवन जन मोहे॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "अक्षमाला वनमाला मुण्डमाला धारी।\n" +
                "त्रिपुरारी कंसारी कर माला धारी॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "श्वेताम्बर पीताम्बर बाघम्बर अंगे।\n" +
                "सनकादिक गरुणादिक भूतादिक संगे॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "कर के मध्य कमण्डलु चक्र त्रिशूलधारी।\n" +
                "सुखकारी दुखहारी जगपालन कारी॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "ब्रह्मा विष्णु सदाशिव जानत अविवेका।\n" +
                "मधु-कैटभ दो\u200Cउ मारे, सुर भयहीन करे॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "लक्ष्मी व सावित्री पार्वती संगा।\n" +
                "पार्वती अर्द्धांगी, शिवलहरी गंगा॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "पर्वत सोहैं पार्वती, शंकर कैलासा।\n" +
                "भांग धतूर का भोजन, भस्मी में वासा॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "जटा में गंग बहत है, गल मुण्डन माला।\n" +
                "शेष नाग लिपटावत, ओढ़त मृगछाला॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "काशी में विराजे विश्वनाथ, नन्दी ब्रह्मचारी।\n" +
                "नित उठ दर्शन पावत, महिमा अति भारी॥\n" +
                "ॐ जय शिव ओंकारा॥\n" +
                "त्रिगुणस्वामी जी की आरति जो कोइ नर गावे।\n" +
                "कहत शिवानन्द स्वामी, मनवान्छित फल पावे॥\n" +
                "ॐ जय शिव ओंकारा॥\n");
        return aarti;
    }


    public static Aarti getAmbeAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.ambe);
        aarti.setTitle("आरती श्री अम्बा जी ");
        aarti.setDescription("जय अम्बे गौरी, मैया जय श्यामा गौरी।\n" +
                "तुमको निशिदिन ध्यावत, हरि ब्रह्मा शिवरी॥\n" +
                "जय अम्बे गौरी\n" +
                "माँग सिन्दूर विराजत, टीको मृगमद को।\n" +
                "उज्जवल से दो\u200Cउ नैना, चन्द्रवदन नीको॥\n" +
                "जय अम्बे गौरी\n" +
                "कनक समान कलेवर, रक्ताम्बर राजै।\n" +
                "रक्तपुष्प गल माला, कण्ठन पर साजै॥\n" +
                "जय अम्बे गौरी\n" +
                "केहरि वाहन राजत, खड्ग खप्परधारी।\n" +
                "सुर-नर-मुनि-जन सेवत, तिनके दुखहारी॥\n" +
                "जय अम्बे गौरी\n" +
                "कानन कुण्डल शोभित, नासाग्रे मोती।\n" +
                "कोटिक चन्द्र दिवाकर, सम राजत ज्योति॥\n" +
                "जय अम्बे गौरी\n" +
                "शुम्भ-निशुम्भ बिदारे, महिषासुर घाती।\n" +
                "धूम्र विलोचन नैना, निशिदिन मदमाती॥\n" +
                "जय अम्बे गौरी\n" +
                "चण्ड-मुण्ड संहारे, शोणित बीज हरे।\n" +
                "मधु-कैटभ दो\u200Cउ मारे, सुर भयहीन करे॥\n" +
                "जय अम्बे गौरी\n" +
                "ब्रहमाणी रुद्राणी तुम कमला रानी।\n" +
                "आगम-निगम-बखानी, तुम शिव पटरानी॥\n" +
                "जय अम्बे गौरी\n" +
                "चौंसठ योगिनी मंगल गावत, नृत्य करत भैरूँ।\n" +
                "बाजत ताल मृदंगा, अरु बाजत डमरु॥\n" +
                "जय अम्बे गौरी\n" +
                "तुम ही जग की माता, तुम ही हो भरता।\n" +
                "भक्\u200Dतन की दु:ख हरता, सुख सम्पत्ति करता॥\n" +
                "जय अम्बे गौरी\n" +
                "भुजा चार अति शोभित, वर-मुद्रा धारी।\n" +
                "मनवान्छित फल पावत, सेवत नर-नारी॥\n" +
                "जय अम्बे गौरी\n" +
                "कन्चन थाल विराजत, अगर कपूर बाती।\n" +
                "श्रीमालकेतु में राजत, कोटि रतन ज्योति॥\n" +
                "जय अम्बे गौरी\n" +
                "श्री अम्बेजी की आरती, जो को\u200Cई नर गावै।\n" +
                "कहत शिवानन्द स्वामी, सुख सम्पत्ति पावै॥\n" +
                "जय अम्बे गौरी");
        return aarti;
    }

    public static Aarti getShreeGaneshAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.ganeshji);
        aarti.setTitle("श्री गणेशजी की आरती");
        aarti.setDescription("जय गणेश जय गणेश जय गणेश देवा।\n" +
                "माता जाकी पार्वती पिता महादेवा॥ x2\n" +
                "\n" +
                "एकदन्त दयावन्त चारभुजाधारी\n" +
                "माथे पर तिलक सोहे मूसे की सवारी। x2\n" +
                "(माथे पर सिन्दूर सोहे, मूसे की सवारी)\n" +
                "पान चढ़े फूल चढ़े और चढ़े मेवा\n" +
                "(हार चढ़े, फूल चढ़े और चढ़े मेवा)\n" +
                "लड्डुअन का भोग लगे सन्त करें सेवा॥ x2\n" +
                "\n" +
                "जय गणेश जय गणेश जय गणेश देवा।\n" +
                "माता जाकी पार्वती पिता महादेवा॥\n" +
                "\n" +
                "अँधे को आँख देत कोढ़िन को काया\n" +
                "बाँझन को पुत्र देत निर्धन को माया। x2\n" +
                "'सूर' श्याम शरण आए सफल कीजे सेवा\n" +
                "माता जाकी पार्वती पिता महादेवा॥ x2\n" +
                "(दीनन की लाज राखो, शम्भु सुतवारी )\n" +
                "(कामना को पूर्ण करो, जग बलिहारी॥)\n" +
                "\n" +
                "जय गणेश जय गणेश जय गणेश देवा।\n" +
                "माता जाकी पार्वती पिता महादेवा॥");
        return aarti;
    }

    public static Aarti getVinayakAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.vinayak);
        aarti.setTitle("आरती गजबदन विनायककी");
        aarti.setDescription("आरती गजबदन विनायककी। सुर-मुनि-पूजित गणनायककी॥ x2\n" +
                "आरती गजबदन विनायककी॥\n" +
                "एकदन्त शशिभाल गजानन, विघ्नविनाशक शुभगुण कानन।\n" +
                "शिवसुत वन्द्यमान-चतुरानन, दुःखविनाशक सुखदायक की॥\n" +
                "आरती गजबदन विनायककी॥\n" +
                "ऋद्धि-सिद्धि-स्वामी समर्थ अति, विमल बुद्धि दाता सुविमल-मति।\n" +
                "अघ-वन-दहन अमल अबिगत गति, विद्या-विनय-विभव-दायककी॥\n" +
                "आरती गजबदन विनायककी॥\n" +
                "पिङ्गलनयन, विशाल शुण्डधर, धूम्रवर्ण शुचि वज्रांकुश-कर।\n" +
                "लम्बोदर बाधा-विपत्ति-हर, सुर-वन्दित सब विधि लायककी॥\n" +
                "आरती गजबदन विनायककी॥");
        return aarti;
    }

    public static Aarti getGanapatiAarti() {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.ganapati);
        aarti.setTitle("आरती श्री गणपति जी");
        aarti.setDescription("गणपति की सेवा मंगल मेवा, सेवा से सब विघ्न टरैं।\n" +
                "तीन लोक के सकल देवता, द्वार खड़े नित अर्ज करैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।\n" +
                "रिद्धि-सिद्धि दक्षिण वाम विराजें, अरु आनन्द सों चमर करैं।\n" +
                "धूप-दीप अरू लिए आरती भक्त खड़े जयकार करैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।\n" +
                "गुड़ के मोदक भोग लगत हैं मूषक वाहन चढ्या सरैं।\n" +
                "सौम्य रूप को देख गणपति के विघ्न भाग जा दूर परैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।\n" +
                "भादो मास अरु शुक्ल चतुर्थी दिन दोपारा दूर परैं।\n" +
                "लियो जन्म गणपति प्रभु जी दुर्गा मन आनन्द भरैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।\n" +
                "अद्भुत बाजा बजा इन्द्र का देव बंधु सब गान करैं।\n" +
                "श्री शंकर के आनन्द उपज्या नाम सुन्यो सब विघ्न टरैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।\n" +
                "आनि विधाता बैठे आसन, इन्द्र अप्सरा नृत्य करैं।\n" +
                "देख वेद ब्रह्मा जी जाको विघ्न विनाशक नाम धरैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।\n" +
                "एकदन्त गजवदन विनायक त्रिनयन रूप अनूप धरैं।\n" +
                "पगथंभा सा उदर पुष्ट है देव चन्द्रमा हास्य करैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।\n" +
                "दे शराप श्री चन्द्रदेव को कलाहीन तत्काल करैं।\n" +
                "चौदह लोक में फिरें गणपति तीन लोक में राज्य करैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।\n" +
                "उठि प्रभात जप करैं ध्यान कोई ताके कारज सर्व सरैं।\n" +
                "पूजा काल आरती गावैं ताके शिर यश छत्र फिरैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।\n" +
                "गणपति की पूजा पहले करने से काम सभी निर्विघ्न सरैं।\n" +
                "सभी भक्त गणपति जी के हाथ जोड़कर स्तुति करैं॥\n" +
                "गणपति की सेवा मंगल मेवा...।");

        return aarti;

    }

    public static Aarti getKunjBihariAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.krishna);
        aarti.setTitle("आरती कुंजबिहारी की, श्री गिरिधर कृष्णमुरारी की ");
        aarti.setDescription("गले में बैजंती माला, बजावै मुरली मधुर बाला।\n" +
                "श्रवण में कुण्डल झलकाला, नंद के आनंद नंदलाला।\n" +
                "गगन सम अंग कांति काली, राधिका चमक रही आली।\n" +
                "लतन में ठाढ़े बनमाली;\n" +
                "भ्रमर सी अलक, कस्तूरी तिलक, चंद्र सी झलक;\n" +
                "ललित छवि श्यामा प्यारी की॥\n" +
                "श्री गिरिधर कृष्णमुरारी की॥\n" +
                "आरती कुंजबिहारी की\n" +
                "श्री गिरिधर कृष्णमुरारी की॥ x2\n" +
                "\n" +
                "कनकमय मोर मुकुट बिलसै, देवता दरसन को तरसैं।\n" +
                "गगन सों सुमन रासि बरसै;\n" +
                "बजे मुरचंग, मधुर मिरदंग, ग्वालिन संग;\n" +
                "अतुल रति गोप कुमारी की॥\n" +
                "श्री गिरिधर कृष्णमुरारी की॥\n" +
                "आरती कुंजबिहारी की\n" +
                "श्री गिरिधर कृष्णमुरारी की॥ x2\n" +
                "\n" +
                "जहां ते प्रकट भई गंगा, कलुष कलि हारिणि श्रीगंगा।\n" +
                "स्मरन ते होत मोह भंगा;\n" +
                "बसी सिव सीस, जटा के बीच, हरै अघ कीच;\n" +
                "चरन छवि श्रीबनवारी की॥\n" +
                "श्री गिरिधर कृष्णमुरारी की॥\n" +
                "आरती कुंजबिहारी की\n" +
                "श्री गिरिधर कृष्णमुरारी की॥ x2\n" +
                "\n" +
                "चमकती उज्ज्वल तट रेनू, बज रही वृंदावन बेनू।\n" +
                "चहुं दिसि गोपि ग्वाल धेनू;\n" +
                "हंसत मृदु मंद,चांदनी चंद, कटत भव फंद;\n" +
                "टेर सुन दीन भिखारी की॥\n" +
                "श्री गिरिधर कृष्णमुरारी की॥\n" +
                "आरती कुंजबिहारी की\n" +
                "श्री गिरिधर कृष्णमुरारी की॥ x2\n" +
                "\n" +
                "आरती कुंजबिहारी की, श्री गिरिधर कृष्ण मुरारी की॥\n" +
                "आरती कुंजबिहारी की, श्री गिरिधर कृष्ण मुरारी की॥");
        return aarti;
    }

    public static Aarti getBakeBihariAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.bake_bihari);
        aarti.setTitle("श्री बाँकेबिहारी की आरती ");
        aarti.setDescription("श्री बाँकेबिहारी तेरी आरती गाऊँ।\n" +
                "कुन्जबिहारी तेरी आरती गाऊँ।\n" +
                "श्री श्यामसुन्दर तेरी आरती गाऊँ।\n" +
                "श्री बाँकेबिहारी तेरी आरती गाऊँ॥\n" +
                "\n" +
                "मोर मुकुट प्रभु शीश पे सोहे।\n" +
                "प्यारी बंशी मेरो मन मोहे।\n" +
                "देखि छवि बलिहारी जाऊँ।\n" +
                "श्री बाँकेबिहारी तेरी आरती गाऊँ॥\n" +
                "\n" +
                "चरणों से निकली गंगा प्यारी।\n" +
                "जिसने सारी दुनिया तारी।\n" +
                "मैं उन चरणों के दर्शन पाऊँ।\n" +
                "श्री बाँकेबिहारी तेरी आरती गाऊँ॥\n" +
                "\n" +
                "दास अनाथ के नाथ आप हो।\n" +
                "दुःख सुख जीवन प्यारे साथ हो।\n" +
                "हरि चरणों में शीश नवाऊँ।\n" +
                "श्री बाँकेबिहारी तेरी आरती गाऊँ॥\n" +
                "\n" +
                "श्री हरि दास के प्यारे तुम हो।\n" +
                "मेरे मोहन जीवन धन हो।\n" +
                "देखि युगल छवि बलि-बलि जाऊँ।\n" +
                "श्री बाँकेबिहारी तेरी आरती गाऊँ॥\n" +
                "\n" +
                "आरती गाऊँ प्यारे तुमको रिझाऊँ।\n" +
                "हे गिरिधर तेरी आरती गाऊँ।\n" +
                "श्री श्यामसुन्दर तेरी आरती गाऊँ।\n" +
                "श्री बाँकेबिहारी तेरी आरती गाऊँ॥");
        return aarti;
    }



    public static Aarti getRamayanAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.ramayan);
        aarti.setTitle("श्री रामायणजी की आरती ");
        aarti.setDescription("आरती श्री रामायण जी की। कीरति कलित ललित सिया-पी की॥\n" +
                "गावत ब्राह्मादिक मुनि नारद। बालमीक विज्ञान विशारद।\n" +
                "शुक सनकादि शेष अरु शारद। बरनि पवनसुत कीरति नीकी॥\n" +
                "आरती श्री रामायण जी की।\n" +
                "कीरति कलित ललित सिया-पी की॥\n" +
                "गावत वेद पुरान अष्टदस। छओं शास्त्र सब ग्रन्थन को रस।\n" +
                "मुनि-मन धन सन्तन को सरबस। सार अंश सम्मत सबही की॥\n" +
                "आरती श्री रामायण जी की।\n" +
                "कीरति कलित ललित सिया-पी की॥\n" +
                "गावत सन्तत शम्भू भवानी। अरु घट सम्भव मुनि विज्ञानी।\n" +
                "व्यास आदि कविबर्ज बखानी। कागभुषुण्डि गरुड़ के ही की॥\n" +
                "आरती श्री रामायण जी की।\n" +
                "कीरति कलित ललित सिया-पी की॥\n" +
                "कलिमल हरनि विषय रस फीकी। सुभग सिंगार मुक्ति जुबती की।\n" +
                "दलन रोग भव मूरि अमी की। तात मात सब विधि तुलसी की॥\n" +
                "आरती श्री रामायण जी की।\n" +
                "कीरति कलित ललित सिया-पी की॥");
        return aarti;
    }

    public static Aarti getJagdishAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.jagdish);
        aarti.setTitle("आरती श्री जगदीशजी ");
        aarti.setDescription(
                "ॐ जय जगदीश हरे, स्वामी ! जय जगदीश हरे।\n" +
                "भक्त जनों के संकट, क्षण में दूर करे॥\n" +
                "ॐ जय जगदीश हरे।\n" +
                "जो ध्यावे फल पावे, दुःख विनसे मन का।\n" +
                "स्वामी दुःख विनसे मन का।\n" +
                "सुख सम्पत्ति घर आवे, कष्ट मिटे तन का॥\n" +
                "ॐ जय जगदीश हरे।\n" +
                "मात-पिता तुम मेरे, शरण गहूँ मैं किसकी।\n" +
                "स्वामी शरण गहूँ मैं किसकी।\n" +
                "तुम बिन और न दूजा, आस करूँ जिसकी॥\n" +
                "ॐ जय जगदीश हरे।\n" +
                "तुम पूरण परमात्मा, तुम अन्तर्यामी।\n" +
                "स्वामी तुम अन्तर्यामी।\n" +
                "पारब्रह्म परमेश्वर, तुम सबके स्वामी॥\n" +
                "ॐ जय जगदीश हरे।\n" +
                "तुम करुणा के सागर, तुम पालन-कर्ता।\n" +
                "स्वामी तुम पालन-कर्ता।\n" +
                "मैं मूरख खल कामी, कृपा करो भर्ता॥\n" +
                "ॐ जय जगदीश हरे।\n" +
                "तुम हो एक अगोचर, सबके प्राणपति।\n" +
                "स्वामी सबके प्राणपति।\n" +
                "किस विधि मिलूँ दयामय, तुमको मैं कुमति॥\n" +
                "ॐ जय जगदीश हरे।\n" +
                "दीनबन्धु दुखहर्ता, तुम ठाकुर मेरे।\n" +
                "स्वामी तुम ठाकुर मेरे।\n" +
                "अपने हाथ उठा\u200Cओ, द्वार पड़ा तेरे॥\n" +
                "ॐ जय जगदीश हरे।\n" +
                "विषय-विकार मिटा\u200Cओ, पाप हरो देवा।\n" +
                "स्वमी पाप हरो देवा।\n" +
                "श्रद्धा-भक्ति बढ़ा\u200Cओ, सन्तन की सेवा॥\n" +
                "ॐ जय जगदीश हरे।\n" +
                "श्री जगदीशजी की आरती, जो कोई नर गावे।\n" +
                "स्वामी जो कोई नर गावे।\n" +
                "कहत शिवानन्द स्वामी, सुख संपत्ति पावे॥\n" +
                "ॐ जय जगदीश हरे।");
        return aarti;
    }

    public static Aarti getSatyaNarayanAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.satyanarayan);
        aarti.setTitle("आरती श्री सत्यनारायणजी");
        aarti.setDescription("जय लक्ष्मीरमणा श्री जय लक्ष्मीरमणा।\n" +
                "सत्यनारायण स्वामी जनपातक हरणा॥\n" +
                "जय लक्ष्मीरमणा।\n" +
                "रत्नजड़ित सिंहासन अद्भुत छवि राजे।\n" +
                "नारद करत निराजन घंटा ध्वनि बाजे॥\n" +
                "जय लक्ष्मीरमणा।\n" +
                "प्रगट भये कलि कारण द्विज को दर्श दियो।\n" +
                "बूढ़ो ब्राह्मण बनकर कंचन महल कियो॥\n" +
                "जय लक्ष्मीरमणा।\n" +
                "दुर्बल भील कठारो इन पर कृपा करी।\n" +
                "चन्द्रचूड़ एक राजा जिनकी विपति हरी॥\n" +
                "जय लक्ष्मीरमणा।\n" +
                "वैश्य मनोरथ पायो श्रद्धा तज दीनी।\n" +
                "सो फल भोग्यो प्रभुजी फिर स्तुति कीनी॥\n" +
                "जय लक्ष्मीरमणा।\n" +
                "भाव भक्ति के कारण छिन-छिन रूप धर्यो।\n" +
                "श्रद्धा धारण कीनी तिनको काज सर्यो॥\n" +
                "जय लक्ष्मीरमणा।\n" +
                "ग्वाल बाल संग राजा वन में भक्ति करी।\n" +
                "मनवांछित फल दीनो दीनदयाल हरी॥\n" +
                "जय लक्ष्मीरमणा।\n" +
                "चढ़त प्रसाद सवाया कदली फल मेवा।\n" +
                "धूप दीप तुलसी से राजी सत्यदेवा॥\n" +
                "जय लक्ष्मीरमणा।\n" +
                "श्री सत्यनारायणजी की आरती जो कोई नर गावे।\n" +
                "कहत शिवानन्द स्वामी मनवांछित फल पावे॥\n" +
                "जय लक्ष्मीरमणा।\n");
        return aarti;
    }
    public static Aarti getSuryadevAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.suryadev);
        aarti.setTitle("आरती श्री सूर्य जी ");
        aarti.setDescription("जय कश्यप-नन्दन, ॐ जय अदिति नन्दन।\n" +
                "त्रिभुवन - तिमिर - निकन्दन, भक्त-हृदय-चन्दन॥\n" +
                "जय कश्यप-नन्दन, ॐ जय अदिति नन्दन।\n" +
                "सप्त-अश्वरथ राजित, एक चक्रधारी।\n" +
                "दु:खहारी, सुखकारी, मानस-मल-हारी॥\n" +
                "जय कश्यप-नन्दन, ॐ जय अदिति नन्दन।\n" +
                "सुर - मुनि - भूसुर - वन्दित, विमल विभवशाली।\n" +
                "अघ-दल-दलन दिवाकर, दिव्य किरण माली॥\n" +
                "जय कश्यप-नन्दन, ॐ जय अदिति नन्दन।\n" +
                "सकल - सुकर्म - प्रसविता, सविता शुभकारी।\n" +
                "विश्व-विलोचन मोचन, भव-बन्धन भारी॥\n" +
                "जय कश्यप-नन्दन, ॐ जय अदिति नन्दन।\n" +
                "कमल-समूह विकासक, नाशक त्रय तापा।\n" +
                "सेवत साहज हरत अति मनसिज-संतापा॥\n" +
                "जय कश्यप-नन्दन, ॐ जय अदिति नन्दन।\n" +
                "नेत्र-व्याधि हर सुरवर, भू-पीड़ा-हारी।\n" +
                "वृष्टि विमोचन संतत, परहित व्रतधारी॥\n" +
                "जय कश्यप-नन्दन, ॐ जय अदिति नन्दन।\n" +
                "सूर्यदेव करुणाकर, अब करुणा कीजै।\n" +
                "हर अज्ञान-मोह सब, तत्त्वज्ञान दीजै॥\n" +
                "जय कश्यप-नन्दन, ॐ जय अदिति नन्दन।");
        return aarti;
    }

    public static Aarti getPurshotamAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.purshotam);
        aarti.setTitle("श्री पुरुषोत्तम देव की आरती");
        aarti.setDescription("जय पुरुषोत्तम देवा, स्वामी जय पुरुषोत्तम देवा।\n" +
                "महिमा अमित तुम्हारी, सुर-मुनि करें सेवा॥\n" +
                "जय पुरुषोत्तम देवा॥\n" +
                "सब मासों में उत्तम, तुमको बतलाया।\n" +
                "कृपा हुई जब हरि की, कृष्ण रूप पाया॥\n" +
                "जय पुरुषोत्तम देवा॥\n" +
                "पूजा तुमको जिसने सर्व सुक्ख दीना।\n" +
                "निर्मल करके काया, पाप छार कीना॥\n" +
                "जय पुरुषोत्तम देवा॥\n" +
                "मेधावी मुनि कन्या, महिमा जब जानी।\n" +
                "द्रोपदि नाम सती से, जग ने सन्मानी॥\n" +
                "जय पुरुषोत्तम देवा॥\n" +
                "विप्र सुदेव सेवा कर, मृत सुत पुनि पाया।\n" +
                "धाम हरि का पाया, यश जग में छाया॥\n" +
                "जय पुरुषोत्तम देवा॥\n" +
                "नृप दृढ़धन्वा पर जब, तुमने कृपा करी।\n" +
                "व्रतविधि नियम और पूजा, कीनी भक्ति भरी॥\n" +
                "जय पुरुषोत्तम देवा॥\n" +
                "शूद्र मणीग्रिव पापी, दीपदान किया।\n" +
                "निर्मल बुद्धि तुम करके, हरि धाम दिया॥\n" +
                "जय पुरुषोत्तम देवा॥\n" +
                "पुरुषोत्तम व्रत-पूजा हित चित से करते।\n" +
                "प्रभुदास भव नद से सहजही वे तरते॥\n" +
                "जय पुरुषोत्तम देवा॥");
        return aarti;
    }

    public static Aarti getShaniAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.shani);
        aarti.setTitle("शनिदेव की आरती");
        aarti.setDescription("जय जय श्री शनिदेव भक्तन हितकारी।\n" +
                "सूरज के पुत्र प्रभु छाया महतारी॥\n" +
                "जय जय श्री शनिदेव भक्तन हितकारी॥\n" +
                "\n" +
                "श्याम अंग वक्र-दृ\u200Dष्टि चतुर्भुजा धारी।\n" +
                "निलाम्बर धार नाथ गज की असवारी॥\n" +
                "जय जय श्री शनिदेव भक्तन हितकारी॥\n" +
                "\n" +
                "क्रीट मुकुट शीश सहज दिपत है लिलारी।\n" +
                "मुक्तन की माल गले शोभित बलिहारी॥\n" +
                "जय जय श्री शनिदेव भक्तन हितकारी॥\n" +
                "\n" +
                "मोदक और मिष्ठान चढ़े, चढ़ती पान सुपारी।\n" +
                "लोहा, तिल, तेल, उड़द महिषी है अति प्यारी॥\n" +
                "जय जय श्री शनिदेव भक्तन हितकारी॥\n" +
                "\n" +
                "देव दनुज ऋषि मुनि सुमिरत नर नारी।\n" +
                "विश्वनाथ धरत ध्यान हम हैं शरण तुम्हारी॥\n" +
                "जय जय श्री शनिदेव भक्तन हितकारी॥");
        return aarti;
    }

    public static Aarti getNarshimhAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.narshimha);
        aarti.setTitle("श्री नरसिंह भगवान की आरती");
        aarti.setDescription("ॐ जय नरसिंह हरे, प्रभु जय नरसिंह हरे।\n" +
                "स्तम्भ फाड़ प्रभु प्रकटे, स्तम्भ फाड़ प्रभु प्रकटे, जन का ताप हरे॥\n" +
                "ॐ जय नरसिंह हरे॥\n" +
                "तुम हो दीन दयाला, भक्तन हितकारी, प्रभु भक्तन हितकारी।\n" +
                "अद्भुत रूप बनाकर, अद्भुत रूप बनाकर, प्रकटे भय हारी॥\n" +
                "ॐ जय नरसिंह हरे॥\n" +
                "सबके ह्रदय विदारण, दुस्यु जियो मारी, प्रभु दुस्यु जियो मारी।\n" +
                "दास जान अपनायो, दास जान अपनायो, जन पर कृपा करी॥\n" +
                "ॐ जय नरसिंह हरे॥\n" +
                "ब्रह्मा करत आरती, माला पहिनावे, प्रभु माला पहिनावे।\n" +
                "शिवजी जय जय कहकर, पुष्पन बरसावे॥\n" +
                "ॐ जय नरसिंह हरे॥");
        return aarti;
    }

    public static Aarti getNarshimhBahgwanAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.narsimha_bhagwan);
        aarti.setTitle("आरती श्री नरसिंह भगवान जी की");
        aarti.setDescription("आरती कीजै नरसिंह कुँवर की। वेद विमल यश गाऊँ मेरे प्रभुजी॥\n" +
                "पहली आरती प्रह्लाद उबारे, हिरणाकुश नख उदर विदारे।\n" +
                "दूसरी आरती वामन सेवा, बलि के द्वार पधारे हरि देवा।\n" +
                "तीसरी आरती ब्रह्म पधारे, सहसबाहु के भुजा उखारे।\n" +
                "चौथी आरती असुर संहारे, भक्त विभीषण लंक पधारे।\n" +
                "पाँचवीं आरती कंस पछारे, गोपी ग्वाल सखा प्रतिपाले।\n" +
                "तुलसी को पत्र कण्ठ मणि हीरा, हरषि-निरखि गावें दास कबीरा।");
        return aarti;
    }

    public static Aarti getChitraGuptAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.chitragupt);
        aarti.setTitle("श्री चित्रगुप्त जी की आरती ");
        aarti.setDescription("ॐ जय चित्रगुप्त हरे, स्वामी जय चित्रगुप्त हरे।\n" +
                "भक्त जनों के इच्छित, फल को पूर्ण करे॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "विघ्न विनाशक मंगलकर्ता, सन्तन सुखदायी।\n" +
                "भक्तन के प्रतिपालक, त्रिभुवन यश छायी॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "रूप चतुर्भुज, श्यामल मूरति, पीताम्बर राजै।\n" +
                "मातु इरावती, दक्षिणा, वाम अङ्ग साजै॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "कष्ट निवारण, दुष्ट संहारण, प्रभु अन्तर्यामी।\n" +
                "सृष्टि संहारण, जन दु:ख हारण, प्रकट हुये स्वामी॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "कलम, दवात, शङ्ख, पत्रिका, कर में अति सोहै।\n" +
                "वैजयन्ती वनमाला, त्रिभुवन मन मोहै॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "सिंहासन का कार्य सम्भाला, ब्रह्मा हर्षाये।\n" +
                "तैंतीस कोटि देवता, चरणन में धाये॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "नृपति सौदास, भीष्म पितामह, याद तुम्हें कीन्हा।\n" +
                "वेगि विलम्ब न लायो, इच्छित फल दीन्हा॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "दारा, सुत, भगिनी, सब अपने स्वास्थ के कर्ता।\n" +
                "जाऊँ कहाँ शरण में किसकी, तुम तज मैं भर्ता॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "बन्धु, पिता तुम स्वामी, शरण गहूँ किसकी।\n" +
                "तुम बिन और न दूजा, आस करूँ जिसकी॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "जो जन चित्रगुप्त जी की आरती, प्रेम सहित गावैं।\n" +
                "चौरासी से निश्चित छूटैं, इच्छित फल पावैं॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥\n" +
                "न्यायाधीश बैकुण्ठ निवासी, पाप पुण्य लिखते।\n" +
                "हम हैं शरण तिहारी, आस न दूजी करते॥\n" +
                "ॐ जय चित्रगुप्त हरे...॥");
        return aarti;
    }


    public static Aarti getLakshmiAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.laksmi);
        aarti.setTitle("आरती श्री लक्ष्मी जी ");
        aarti.setDescription("ॐ जय लक्ष्मी माता, मैया जय लक्ष्मी माता।\n" +
                "तुमको निशिदिन सेवत, हरि विष्णु विधाता॥\n" +
                "ॐ जय लक्ष्मी माता॥\n" +
                "उमा, रमा, ब्रह्माणी, तुम ही जग-माता।\n" +
                "सूर्य-चन्द्रमा ध्यावत, नारद ऋषि गाता॥\n" +
                "ॐ जय लक्ष्मी माता॥\n" +
                "दुर्गा रुप निरंजनी, सुख सम्पत्ति दाता।\n" +
                "जो कोई तुमको ध्यावत, ऋद्धि-सिद्धि धन पाता॥\n" +
                "ॐ जय लक्ष्मी माता॥\n" +
                "तुम पाताल-निवासिनि, तुम ही शुभदाता।\n" +
                "कर्म-प्रभाव-प्रकाशिनी, भवनिधि की त्राता॥\n" +
                "ॐ जय लक्ष्मी माता॥\n" +
                "जिस घर में तुम रहतीं, सब सद्गुण आता।\n" +
                "सब सम्भव हो जाता, मन नहीं घबराता॥\n" +
                "ॐ जय लक्ष्मी माता॥\n" +
                "तुम बिन यज्ञ न होते, वस्त्र न कोई पाता।\n" +
                "खान-पान का वैभव, सब तुमसे आता॥\n" +
                "ॐ जय लक्ष्मी माता॥\n" +
                "शुभ-गुण मन्दिर सुन्दर, क्षीरोदधि-जाता।\n" +
                "रत्न चतुर्दश तुम बिन, कोई नहीं पाता॥\n" +
                "ॐ जय लक्ष्मी माता॥\n" +
                "महालक्ष्मीजी की आरती, जो कोई जन गाता।\n" +
                "उर आनन्द समाता, पाप उतर जाता॥\n" +
                "ॐ जय लक्ष्मी माता॥");
        return aarti;
    }

    public static Aarti getViashnoAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.vaishno);
        aarti.setTitle("आरती श्री वैष्णो देवी");
        aarti.setDescription("जय वैष्णवी माता, मैया जय वैष्णवी माता।\n" +
                "हाथ जोड़ तेरे आगे, आरती मैं गाता॥\n" +
                "शीश पे छत्र विराजे, मूरतिया प्यारी।\n" +
                "गंगा बहती चरनन, ज्योति जगे न्यारी॥\n" +
                "ब्रह्मा वेद पढ़े नित द्वारे, शंकर ध्यान धरे।\n" +
                "सेवक चंवर डुलावत, नारद नृत्य करे॥\n" +
                "सुन्दर गुफा तुम्हारी, मन को अति भावे।\n" +
                "बार-बार देखन को, ऐ माँ मन चावे॥\n" +
                "भवन पे झण्डे झूलें, घंटा ध्वनि बाजे।\n" +
                "ऊँचा पर्वत तेरा, माता प्रिय लागे॥\n" +
                "पान सुपारी ध्वजा नारियल, भेंट पुष्प मेवा।\n" +
                "दास खड़े चरणों में, दर्शन दो देवा॥\n" +
                "जो जन निश्चय करके, द्वार तेरे आवे।\n" +
                "उसकी इच्छा पूरण, माता हो जावे॥\n" +
                "इतनी स्तुति निश-दिन, जो नर भी गावे।\n" +
                "कहते सेवक ध्यानू, सुख सम्पत्ति पावे॥");
        return aarti;
    }

    public static Aarti getDurgaAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.durga);
        aarti.setTitle("आरती श्री दुर्गाजी ");
        aarti.setDescription("अम्बे तू है जगदम्बे काली, जय दुर्गे खप्पर वाली,\n" +
                "तेरे ही गुण गावें भारती, ओ मैया हम सब उतारे तेरी आरती।\n" +
                "तेरे भक्त जनो पर माता भीर पड़ी है भारी।\n" +
                "दानव दल पर टूट पड़ो माँ करके सिंह सवारी॥\n" +
                "सौ-सौ सिहों से बलशाली, है अष्ट भुजाओं वाली,\n" +
                "दुष्टों को तू ही ललकारती।\n" +
                "ओ मैया हम सब उतारे तेरी आरती॥\n" +
                "माँ-बेटे का है इस जग में बड़ा ही निर्मल नाता।\n" +
                "पूत-कपूत सुने है पर ना माता सुनी कुमाता॥\n" +
                "सब पे करूणा दर्शाने वाली, अमृत बरसाने वाली,\n" +
                "दुखियों के दुखड़े निवारती।\n" +
                "ओ मैया हम सब उतारे तेरी आरती॥\n" +
                "नहीं मांगते धन और दौलत, न चांदी न सोना।\n" +
                "हम तो मांगें तेरे चरणों में छोटा सा कोना॥\n" +
                "सबकी बिगड़ी बनाने वाली, लाज बचाने वाली,\n" +
                "सतियों के सत को संवारती।\n" +
                "ओ मैया हम सब उतारे तेरी आरती॥\n" +
                "चरण शरण में खड़े तुम्हारी, ले पूजा की थाली।\n" +
                "वरद हस्त सर पर रख दो माँ संकट हरने वाली॥\n" +
                "माँ भर दो भक्ति रस प्याली, अष्ट भुजाओं वाली,\n" +
                "भक्तों के कारज तू ही सारती।\n" +
                "ओ मैया हम सब उतारे तेरी आरती॥");
        return aarti;
    }

    public static Aarti getParvatiAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.parvati);
        aarti.setTitle("श्री पार्वती माता जी की आरती");
        aarti.setDescription("जय पार्वती माता जय पार्वती माता।\n" +
                "ब्रह्म सनातन देवी शुभ फल की दाता॥\n" +
                "जय पार्वती माता\n" +
                "अरिकुल पद्म विनाशिनि जय सेवक त्राता।\n" +
                "जग जीवन जगदम्बा, हरिहर गुण गाता॥\n" +
                "जय पार्वती माता\n" +
                "सिंह को वाहन साजे, कुण्डल हैं साथा।\n" +
                "देव वधू जस गावत, नृत्य करत ताथा॥\n" +
                "जय पार्वती माता\n" +
                "सतयुग रूपशील अतिसुन्दर, नाम सती कहलाता।\n" +
                "हेमांचल घर जन्मी, सखियन संग राता॥\n" +
                "जय पार्वती माता\n" +
                "शुम्भ निशुम्भ विदारे, हेमांचल स्थाता।\n" +
                "सहस्त्र भुजा तनु धरि के, चक्र लियो हाथा॥\n" +
                "जय पार्वती माता\n" +
                "सृष्टि रूप तुही है जननी शिवसंग रंगराता।\n" +
                "नन्दी भृंगी बीन लही सारा जग मदमाता॥\n" +
                "जय पार्वती माता\n" +
                "देवन अरज करत हम चित को लाता।\n" +
                "गावत दे दे ताली, मन में रंगराता॥\n" +
                "जय पार्वती माता\n" +
                "श्री प्रताप आरती मैया की, जो कोई गाता।\n" +
                "सदासुखी नित रहता सुख सम्पत्ति पाता॥\n" +
                "जय पार्वती माता");
        return aarti;
    }

    public static Aarti getsarashvatiAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.saraswati);
        aarti.setTitle("आरती श्री सरस्वती जी ");
        aarti.setDescription("जय सरस्वती माता, मैया जय सरस्वती माता।\n" +
                "सदगुण वैभव शालिनी, त्रिभुवन विख्याता॥\n" +
                "जय सरस्वती माता॥\n" +
                "चन्द्रवदनि पद्मासिनि, द्युति मंगलकारी।\n" +
                "सोहे शुभ हंस सवारी, अतुल तेजधारी॥\n" +
                "जय सरस्वती माता॥\n" +
                "बाएं कर में वीणा, दाएं कर माला।\n" +
                "शीश मुकुट मणि सोहे, गल मोतियन माला॥\n" +
                "जय सरस्वती माता॥\n" +
                "देवी शरण जो आए, उनका उद्धार किया।\n" +
                "पैठी मंथरा दासी, रावण संहार किया॥\n" +
                "जय सरस्वती माता॥\n" +
                "विद्या ज्ञान प्रदायिनि, ज्ञान प्रकाश भरो।\n" +
                "मोह अज्ञान और तिमिर का, जग से नाश करो॥\n" +
                "जय सरस्वती माता॥\n" +
                "धूप दीप फल मेवा, माँ स्वीकार करो।\n" +
                "ज्ञानचक्षु दे माता, जग निस्तार करो॥\n" +
                "जय सरस्वती माता॥\n" +
                "माँ सरस्वती की आरती, जो कोई जन गावे।\n" +
                "हितकारी सुखकारी ज्ञान भक्ति पावे॥\n" +
                "जय सरस्वती माता॥\n" +
                "जय सरस्वती माता, जय जय सरस्वती माता।\n" +
                "सदगुण वैभव शालिनी, त्रिभुवन विख्याता॥\n" +
                "जय सरस्वती माता॥");
        return aarti;
    }

    public static Aarti getSantoshiAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.santoshi);
        aarti.setTitle("आरती श्री सन्तोषी माँ");
        aarti.setDescription("जय सन्तोषी माता, मैया जय सन्तोषी माता।\n" +
                "अपने सेवक जन को, सुख सम्पत्ति दाता॥\n" +
                "जय सन्तोषी माता॥\n" +
                "सुन्दर चीर सुनहरी माँ धारण कीन्हों।\n" +
                "हीरा पन्ना दमके, तन श्रृंगार कीन्हों॥\n" +
                "जय सन्तोषी माता॥\n" +
                "गेरू लाल छटा छवि, बदन कमल सोहे।\n" +
                "मन्द हंसत करुणामयी, त्रिभुवन मन मोहे॥\n" +
                "जय सन्तोषी माता॥\n" +
                "स्वर्ण सिंहासन बैठी, चंवर ढुरें प्यारे।\n" +
                "धूप दीप मधुमेवा, भोग धरें न्यारे॥\n" +
                "जय सन्तोषी माता॥\n" +
                "गुड़ अरु चना परमप्रिय, तामे संतोष कियो।\n" +
                "सन्तोषी कहलाई, भक्तन वैभव दियो॥\n" +
                "जय सन्तोषी माता॥\n" +
                "शुक्रवार प्रिय मानत, आज दिवस सोही।\n" +
                "भक्त मण्डली छाई, कथा सुनत मोही॥\n" +
                "जय सन्तोषी माता॥\n" +
                "मन्दिर जगमग ज्योति, मंगल ध्वनि छाई।\n" +
                "विनय करें हम बालक, चरनन सिर नाई॥\n" +
                "जय सन्तोषी माता॥\n" +
                "भक्ति भावमय पूजा, अंगीकृत कीजै।\n" +
                "जो मन बसै हमारे, इच्छा फल दीजै॥\n" +
                "जय सन्तोषी माता॥\n" +
                "दुखी दरिद्री, रोग, संकट मुक्त किये।\n" +
                "बहु धन-धान्य भरे घर, सुख सौभाग्य दिये॥\n" +
                "जय सन्तोषी माता॥\n" +
                "ध्यान धर्यो जिस जन ने, मनवांछित फल पायो।\n" +
                "पूजा कथा श्रवण कर, घर आनन्द आयो॥\n" +
                "जय सन्तोषी माता॥\n" +
                "शरण गहे की लज्जा, राखियो जगदम्बे।\n" +
                "संकट तू ही निवारे, दयामयी अम्बे॥\n" +
                "जय सन्तोषी माता॥\n" +
                "सन्तोषी माता की आरती, जो कोई जन गावे।\n" +
                "ऋद्धि-सिद्धि, सुख-सम्पत्ति, जी भरकर पावे॥\n" +
                "जय सन्तोषी माता॥");
        return aarti;
    }

    public static Aarti getGangaAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.ganga);
        aarti.setTitle("आरती श्री गंगाजी");
        aarti.setDescription("ॐ जय गंगे माता, मैया जय गंगे माता।\n" +
                "जो नर तुमको ध्याता, मनवांछित फल पाता॥\n" +
                "ॐ जय गंगे माता॥\n" +
                "चन्द्र-सी ज्योति तुम्हारी, जल निर्मल आता।\n" +
                "शरण पड़े जो तेरी, सो नर तर जाता॥\n" +
                "ॐ जय गंगे माता॥\n" +
                "पुत्र सगर के तारे, सब जग को ज्ञाता।\n" +
                "कृपा दृष्टि हो तुम्हारी, त्रिभुवन सुख दाता॥\n" +
                "ॐ जय गंगे माता॥\n" +
                "एक बार जो प्राणी, शरण तेरी आता।\n" +
                "यम की त्रास मिटाकर, परमगति पाता॥\n" +
                "ॐ जय गंगे माता॥\n" +
                "आरती मातु तुम्हारी, जो नर नित गाता।\n" +
                "सेवक वही सहज में, मुक्ति को पाता॥\n" +
                "ॐ जय गंगे माता॥\n");
        return aarti;
    }

    public static Aarti getEkadashiAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage(R.drawable.ekadashi);
        aarti.setTitle("एकादशी माता की आरती ");
        aarti.setDescription("ॐ जय एकादशी, जय एकादशी, जय एकादशी माता।\n" +
                "विष्णु पूजा व्रत को धारण कर, शक्ति मुक्ति पाता॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "तेरे नाम गिनाऊं देवी, भक्ति प्रदान करनी।\n" +
                "गण गौरव की देनी माता, शास्त्रों में वरनी॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "मार्गशीर्ष के कृष्णपक्ष की उत्पन्ना, विश्वतारनी जन्मी।\n" +
                "शुक्ल पक्ष में हुई मोक्षदा, मुक्तिदाता बन आई॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "पौष के कृष्णपक्ष की, सफला नामक है।\n" +
                "शुक्लपक्ष में होय पुत्रदा, आनन्द अधिक रहै॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "नाम षटतिला माघ मास में, कृष्णपक्ष आवै।\n" +
                "शुक्लपक्ष में जया, कहावै, विजय सदा पावै॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "विजया फागुन कृष्णपक्ष में शुक्ला आमलकी।\n" +
                "पापमोचनी कृष्ण पक्ष में, चैत्र महाबलि की॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "चैत्र शुक्ल में नाम कामदा, धन देने वाली।\n" +
                "नाम बरुथिनी कृष्णपक्ष में, वैसाख माह वाली॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "शुक्ल पक्ष में होय मोहिनी अपरा ज्येष्ठ कृष्णपक्षी।\n" +
                "नाम निर्जला सब सुख करनी, शुक्लपक्ष रखी॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "योगिनी नाम आषाढ में जानों, कृष्णपक्ष करनी।\n" +
                "देवशयनी नाम कहायो, शुक्लपक्ष धरनी॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "कामिका श्रावण मास में आवै, कृष्णपक्ष कहिए।\n" +
                "श्रावण शुक्ला होय पवित्रा आनन्द से रहिए॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "अजा भाद्रपद कृष्णपक्ष की, परिवर्तिनी शुक्ला।\n" +
                "इन्द्रा आश्चिन कृष्णपक्ष में, व्रत से भवसागर निकला॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "पापांकुशा है शुक्ल पक्ष में, आप हरनहारी।\n" +
                "रमा मास कार्तिक में आवै, सुखदायक भारी॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "देवोत्थानी शुक्लपक्ष की, दुखनाशक मैया।\n" +
                "पावन मास में करूं विनती पार करो नैया॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "परमा कृष्णपक्ष में होती, जन मंगल करनी।\n" +
                "शुक्ल मास में होय पद्मिनी दुख दारिद्र हरनी॥\n" +
                "ॐ जय एकादशी...॥\n" +
                "जो कोई आरती एकादशी की, भक्ति सहित गावै।\n" +
                "जन गुरदिता स्वर्ग का वासा, निश्चय वह पावै॥\n" +
                "ॐ जय एकादशी...॥");
        return aarti;
    }



    /*
    public static Aarti getShivAarti()
    {
        Aarti aarti = new Aarti();
        aarti.setImage();
        aarti.setTitle("");
        aarti.setDescription("");
        return aarti;
    }
    */


}
